; domain
(define (domain warehouse)
    (:requirements :typing)
    (:types 
        location truck direction box - object
    )
    (:predicates
        (dirof ?obj1 - object ?dir - direction ?obj2 - object)
        (rightof ?dir1 - direction ?dir2 - direction)
        (leftof ?dir1 - direction ?dir2 - direction)
        (facedir ?t - truck ?dir - direction)
        (at ?obj - object ?loc - location)
        (empty ?loc - location)
        (holding ?t - truck ?b - box)
        (free ?t - truck)
    )
    (:action move-forward
        :parameters     (?t - truck ?lf - location ?dir - direction ?lt - location)
        :precondition   (and (at ?t ?lf) (facedir ?t ?dir) (dirof ?lt ?dir ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (facedir ?t ?dir) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action rotate-right
        :parameters     (?t - truck ?df - direction ?dt - direction)
        :precondition   (and (facedir ?t ?df) (rightof ?dt ?df))
        :effect         (and (facedir ?t ?dt) (not (facedir ?t ?df)))
    )
    (:action rotate-left
        :parameters     (?t - truck ?df - direction ?dt - direction)
        :precondition   (and (facedir ?t ?df) (leftof ?dt ?df))
        :effect         (and (facedir ?t ?dt) (not (facedir ?t ?df)))
    )
    (:action lift-box
        :parameters     (?t - truck ?b - box ?ltru - location ?lbox - location ?trudir - direction)
        :precondition   (and (at ?t ?ltru) (at ?b ?lbox) (dirof ?lbox ?trudir ?ltru) (facedir ?t ?trudir) (free ?t))
        :effect         (and (not (at ?b ?lbox)) (empty ?lbox) (not (free ?t)) (holding ?t ?b))
    )
    (:action drop-box
        :parameters     (?t - truck ?b - box ?ltru - location ?lbox - location ?trudir - direction)
        :precondition   (and (at ?t ?ltru) (empty ?lbox) (dirof ?lbox ?trudir ?ltru) (facedir ?t ?trudir) (holding ?t ?b))
        :effect         (and (not (empty ?lbox)) (at ?b ?lbox) (not (holding ?t ?B)) (free ?t))
    )
    
)

; problem
(define (problem wh1)
    (:domain warehouse)
    (:objects
        loc00 - location
        loc01 - location
        loc02 - location
        loc10 - location
        loc11 - location
        loc12 - location
        loc20 - location
        loc21 - location
        loc22 - location
        east - direction
        west - direction
        south - direction
        north - direction
        tru1 - truck
        tru2 - truck
        tru3 - truck
        box1 - box
        box2 - box
    )
    (:init
        (dirof loc01 east loc00)
        (dirof loc02 east loc01)
        (dirof loc11 east loc10)
        (dirof loc12 east loc11)
        (dirof loc21 east loc20)
        (dirof loc22 east loc21)
        (dirof loc10 south loc00)
        (dirof loc20 south loc10)
        (dirof loc11 south loc01)
        (dirof loc21 south loc11)
        (dirof loc12 south loc02)
        (dirof loc22 south loc12)
        (dirof loc01 west loc02)
        (dirof loc00 west loc01)
        (dirof loc11 west loc12)
        (dirof loc10 west loc11)
        (dirof loc21 west loc22)
        (dirof loc20 west loc21)
        (dirof loc10 north loc20)
        (dirof loc00 north loc10)
        (dirof loc11 north loc21)
        (dirof loc01 north loc11)
        (dirof loc12 north loc22)
        (dirof loc02 north loc12)
        (rightof east north)
        (rightof south east)
        (rightof west south)
        (rightof north west)
        (leftof east south)
        (leftof north east)
        (leftof west north)
        (leftof south west)
        (at tru1 loc00)
        (at tru2 loc01)
        (at tru3 loc02)
        (at box1 loc20)
        (at box2 loc22)
        (empty loc10)
        (empty loc11)
        (empty loc12)
        (empty loc21)
        (facedir tru1 east)
        (facedir tru2 north)
        (facedir tru3 east)
        (free tru1)
        (free tru2)
        (free tru3)
    )
    (:goal
        (and
            (at tru1 loc11)
            (at tru2 loc21)
            (at tru3 loc20)
            (at box1 loc12)
            (at box2 loc22)
        )
    )
)

; plan
1. (rotate-left tru2 north west)
   deleted: (facedir tru2 north)
   added: (facedir tru2 west)
   goals met: 1 of 5
2. (rotate-left tru2 west south)
   deleted: (facedir tru2 west)
   added: (facedir tru2 south)
   goals met: 1 of 5
3. (move-forward tru2 loc01 south loc11)
   deleted: (at tru2 loc01) (empty loc11)
   added: (empty loc01) (at tru2 loc11)
   goals met: 1 of 5
4. (move-forward tru2 loc11 south loc21)
   deleted: (at tru2 loc11) (empty loc21)
   added: (empty loc11) (at tru2 loc21)
   goals met: 2 of 5
5. (move-forward tru1 loc00 east loc01)
   deleted: (at tru1 loc00) (empty loc01)
   added: (empty loc00) (at tru1 loc01)
   goals met: 2 of 5
6. (rotate-right tru1 east south)
   deleted: (facedir tru1 east)
   added: (facedir tru1 south)
   goals met: 2 of 5
7. (move-forward tru1 loc01 south loc11)
   deleted: (at tru1 loc01) (empty loc11)
   added: (empty loc01) (at tru1 loc11)
   goals met: 3 of 5
8. (rotate-left tru3 east north)
   deleted: (facedir tru3 east)
   added: (facedir tru3 north)
   goals met: 3 of 5
9. (rotate-left tru3 north west)
   deleted: (facedir tru3 north)
   added: (facedir tru3 west)
   goals met: 3 of 5
10. (move-forward tru3 loc02 west loc01)
   deleted: (at tru3 loc02) (empty loc01)
   added: (empty loc02) (at tru3 loc01)
   goals met: 3 of 5
11. (move-forward tru3 loc01 west loc00)
   deleted: (at tru3 loc01) (empty loc00)
   added: (empty loc01) (at tru3 loc00)
   goals met: 3 of 5
12. (rotate-left tru3 west south)
   deleted: (facedir tru3 west)
   added: (facedir tru3 south)
   goals met: 3 of 5
13. (move-forward tru3 loc00 south loc10)
   deleted: (at tru3 loc00) (empty loc10)
   added: (empty loc00) (at tru3 loc10)
   goals met: 3 of 5
14. (lift-box tru3 box1 loc10 loc20 south)
   deleted: (at box1 loc20) (free tru3)
   added: (empty loc20) (holding tru3 box1)
   goals met: 3 of 5
15. (move-forward tru3 loc10 south loc20)
   deleted: (at tru3 loc10) (empty loc20)
   added: (empty loc10) (at tru3 loc20)
   goals met: 4 of 5
16. (rotate-right tru3 south west)
   deleted: (facedir tru3 south)
   added: (facedir tru3 west)
   goals met: 4 of 5
17. (rotate-right tru3 west north)
   deleted: (facedir tru3 west)
   added: (facedir tru3 north)
   goals met: 4 of 5
18. (drop-box tru3 box1 loc20 loc10 north)
   deleted: (empty loc10) (holding tru3 box1)
   added: (at box1 loc10) (free tru3)
   goals met: 4 of 5
19. (rotate-right tru1 south west)
   deleted: (facedir tru1 south)
   added: (facedir tru1 west)
   goals met: 4 of 5
20. (lift-box tru1 box1 loc11 loc10 west)
   deleted: (at box1 loc10) (free tru1)
   added: (empty loc10) (holding tru1 box1)
   goals met: 4 of 5
21. (rotate-right tru1 west north)
   deleted: (facedir tru1 west)
   added: (facedir tru1 north)
   goals met: 4 of 5
22. (rotate-right tru1 north east)
   deleted: (facedir tru1 north)
   added: (facedir tru1 east)
   goals met: 4 of 5
23. (drop-box tru1 box1 loc11 loc12 east)
   deleted: (empty loc12) (holding tru1 box1)
   added: (at box1 loc12) (free tru1)
   goals met: 5 of 5
